org/extension.org
#+title: persemacs-extension
#+author: Erwann Rogard
#+property: header-args :tangle no

#+name: doc-lead
#+begin_src org
  This is a standalone Emacs Org file containing emacs-lisp functionality.
#+end_src

* license

#+name: el-license
#+begin_src emacs-lisp
  ;;  persemacs-extension — Emacs Lisp functionality
  ;;  Copyright (C) 2024—2025 — Erwann Rogard
  ;;  Released under GPL 3.0
  ;;  See https://www.gnu.org/licenses/gpl-3.0.en.html
#+end_src

* source
** el
*** support
**** search

Evaluate (~C-c C-c~)
#+begin_src emacs-lisp
  (org-ql-search (current-buffer)
    '(property "customize" "true")
    :title "Customize Properties")
#+end_src

**** noweb-ref                                                    :tangle:
***** wrap

 #+name: el-wrap
 #+header: :var body=""
 #+header: :var ref=""
 #+header: :var lang=""
 #+begin_src emacs-lisp
   (concat "#+header: :noweb-ref " ref "\n" "#+begin_src " lang "\n" body "\n" "#+end_src")
 #+end_src

***** collect

#+name: el-collect
#+header: :var head="^sh-"
#+header: :var ref-list='()
#+header: :var tail="$"
#+header: :var order=':buffer
#+header: :results raw
#+begin_src emacs-lisp
  (string-join
   (er317/noweb-ref-collect :head head :ref-list ref-list :tail tail :order order) "\n")
#+end_src

#+RESULTS:
: er317/noweb-ref-collect

***** assemble

#+name: el-assemble
#+header: :var head="^json-"
#+header: :var ref-list='()
#+header: :var tail="$"
#+header: :var key-list='()
#+header: :var parse-fn='json-read-from-string
#+header: :var encode-fn='json-encode
#+header: :var order=':buffer
#+begin_src emacs-lisp
  (er317/noweb-ref-assemble
   :head head
   :ref-list ref-list
   :tail tail
   :order order
   :key-list key-list
   :parse-fn parse-fn
   :encode-fn encode-fn)
#+end_src

***** json-pp

#+name: el-json-pp
#+header: :var json=json-object
#+begin_src emacs-lisp
  (with-temp-buffer (insert json) (json-pretty-print (point-min) (point-max)) (buffer-string))
#+end_src

*** topic
**** resolve

#+header: :noweb-ref el-resolve
#+begin_src emacs-lisp
  (cl-defun er317/resolve-func (func)
    "Return function value of F whether it's a symbol or lambda."
    (if (symbolp func) (symbol-function func) func))
#+end_src

#+header: :noweb-ref el-resolve
#+begin_src emacs-lisp
  (cl-defun er317/resolve-symb (symb) ""
            (cond
             ((symbolp symb) symb)
             ((and (consp symb) (eq (car symb) 'quote))
              (cadr symb))))
#+end_src

**** exception
***** module
:PROPERTIES:
:created_on: <2025-06-05 Thu>
:uname:    @elitebook
:is-public: false
:END:
:LOGBOOK:
- Note taken on [2025-06-05 Thu 11:44] \\
  Appears to be buggy.
:END:

#+header: :noweb-ref el-raise
#+begin_src emacs-lisp
  (cl-defmacro er317/raise (&key type (message "ARGS: %S") (arg-list nil) (type-if-nil (if type type 'error)))
    "Raise an error or warning with file and line info.
  TYPE is a function symbol like 'error or 'warn.
  MESSAGE is a format string.
  ARG-LIST is a list of arguments for MESSAGE."
    (let ((file (or load-file-name buffer-file-name))
          (line (line-number-at-pos)))
      `(funcall ,type-if-nil
                (format "[%s:%d] %s"
                        ,file ,line
                        (apply #'format ,message ,arg-list)))))
#+end_src

#+RESULTS:
: er317/raise

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (let ((expected 42)
        (actual 13))
    (when (/= expected actual)
      (er317/raise
       :type 'error
       :message "Mismatch! Expected %d, but got %d"
       :arg-list (list expected actual))))
#+end_src

**** mangle
***** module
****** define

#+header: :noweb-ref el-mangle
#+begin_src emacs-lisp
    (cl-defmacro er317/mangle-config-define
        (&key
         (author-alias "er317")
         (user-alias author-alias)
         (target-name (format "%s/mangle-config-plist" author-alias))
         (doc-string (format "Mangle property list tagged %s." author-alias))
         (key-list '(:commit))
         (commit-re-rep '("^\\([[:alnum:]]\\{7\\}\\).*$" . "\\1"))
         (symbol-name-re-rep (cons (format "^%s/\\([^ ]+\\)$" author-alias) "\\1"))
         (symbol-name-fcs (format "%s-%%s/%%s" author-alias))
         (package-fcs (format "%s-%%s-%%s" author-alias))
         (parent-dir user-emacs-directory)
;;         (dir-name "mangle")
;;         (dir-path (let ((path (expand-file-name dir-name parent-dir)))
;;                    (file-name-as-directory path)))
         )
      "Defines TARGET-NAME as a property list representing the mangle configuration.

       AUTHOR-ALIAS     | Compile-time mangling key
       KEY-LIST         | Run-time mangling key list
       <PREFIX>-FCS     | Format Control String
       <PREFIX>-RE-REP  | (REGEX.REPLACEMENT)"
      `(defconst ,(intern target-name) ,doc-string
         (list
          ,@(apply #'append (mapcar (lambda (symb-name)
                      `(cons ',(intern (format ":%s" symb-name))
                             ,(intern symb-name)))
                    '("author-alias"
                      "user-alias"
                      "target-name"
                      "doc-string"
                      "key-list"
                      "commit-re-rep"
                      "symbol-name-re-rep"
                      "symbol-name-fcs"
                      "package-fcs"
                      "parent-dir"
                      "dir-name"
                      "dir-path"))))))
#+end_src
  	 
**** list
***** module
****** zip-to-list

#+header: :noweb-ref el-zip-to-list
#+begin_src emacs-lisp
  (cl-defun er317/zip-to-plist
      (&key key-list value-list result (discard nil) msg-type)
    "Recursively zip KEY-LIST and VALUE-LIST into a plist. Optionally discard extra values.

    Syntax:
    - KEY-LIST (quote (KEYWORD...))"
        (cond
         ((null key-list)
          (cond
           ((null value-list) result)
           (discard result)
           (t (error "Length mismatch: values left over: %S" value-list))))

         (t
          (let ((key (car key-list)))
            (cond
             ((not (keywordp key))
              (error "Expected keyword, got: %S" key))

             ((null value-list)
              (error "Not enough values for key: %S" key))

             (t
              (er317/zip-to-plist
               :key-list (cdr key-list)
               :value-list (cdr value-list)
               :result (append result (list key (car value-list)))
               :discard discard
               :msg-type msg-type)))))))
;;      (condition-case err
;;
;;      (error
;;       (er317/raise
;;        :message (error-message-string err)))))
#+end_src

#+RESULTS:
: er317/zip-to-plist

#+header: :noweb-ref el-example
#+header: :var name="json-foo"
#+begin_src emacs-lisp :wrap src json
  (let* ((location (org-babel-find-named-block name))
         (info (save-excursion
  	       (goto-char location)
  	       (org-babel-get-src-block-info)))
         (plist (er317/zip-to-plist :key-list '(:lang :body :header-args :switches :name :start :coderef) :value-list info)))
    (plist-get plist :body))
#+end_src

#+RESULTS:
#+begin_src json
{
    "key" : "X"
}
#+end_src

****** plist-if

#+header: :noweb-ref el-plist-if
#+begin_src emacs-lisp
  (cl-defun er317/plist-if (&rest keyval-list)
    "Return a plist containing only the key-value pairs from KEYVAL-LIST
whose values are non-nil."
    (let ((result nil))
      (while keyval-list
        (let ((key (pop keyval-list))
              (value (pop keyval-list)))
          (when value
            (setq result (append result (list key value))))))
      result))
#+end_src

#+RESULTS:
: er317/plist-if

#+header: :results raw verbatim
#+begin_src emacs-lisp
  (plist-get (er317/plist-if :foo "foo" :bar nil :qux "qux") :qux)
#+end_src

#+RESULTS:
"qux"

**** refactor

#+header: :noweb-ref el-refactor
#+begin_src emacs-lisp
  (cl-defmacro er317/refactor
      (&key
       source-func
       target-key-list
       result-key-list
       target-func
       msg-type)
    "Define TARGET-FUNC as a keyword-based function that wraps around SOURCE-FUNC.

         Syntax:
         - SOURCE-FUNC              (quote SYMB) | (lambda (...) ...)
         - <RESULT|TARGET>-KEY-LIST (KEYWORD ... )
         - TARGET-FUNC              (quote SYMB)

         Compile-time:
         - RESULT-FUNC constructed using RESULT-KEY-LIST else `#'identity`

         Runtime behavior:
         TARGET-FUNC (KEYWORD VALUE ...)
         - RESULT <- (apply SOURCE-FUNC VALUE-LIST)
         - RESULT <- (RESULT-FUNC RESULT)
         - RESULT

         Example:
         (er317/refactor
         :source-func 'org-babel-get-src-block-info
         :target-func 'er317/org-babel-info-as-plist
         :target-key-list (:no-eval :datum)
         :result-key-list (:lang :body :header-args :switches :name :start :coderef))"
    (let* (
  	 (result-func
  	  (cond
  	   (result-key-list
  	    `(lambda (result-list)
  	       (er317/zip-to-plist :key-list ',result-key-list :value-list result-list)))
  	   (t #'identity)))
  	 (target-symb
            (cond
             ((symbolp target-func) target-func)
             ((and (consp target-func) (eq (car target-func) 'quote))
              (cadr target-func))
             (t (error "target-func must be a symbol or quoted symbol"))))
     	 (target-symb-list
            (cl-loop for k in target-key-list
                     collect (intern (substring (symbol-name k) 1)))))
      `(cl-defun ,target-symb (&key ,@target-symb-list)
         ,(format "Refactored wrapper around `%s`, accepting keyword args %s."
     		source-func target-key-list)
         (let* ((result-raw (apply ,source-func (list ,@target-symb-list)))
                (result (funcall ,result-func result-raw)))
     	 result))))
#+end_src

#+RESULTS:
: er317/refactor

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (defun er317/source-func (x) (list x (+ x 1)))
#+end_src

#+RESULTS:
: er317/source-func

#+header: :noweb-ref el-example
#+begin_src emacs-lisp  
  (er317/refactor
   :source-func  (lambda (x) (list x (+ x 1)))
;;    'er317/source-func
   :target-key-list (:x)
   :result-key-list (:x :y)
   :target-func 'er317/target-func)
#+end_src

#+RESULTS:
: er317/target-func

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (pp (symbol-function 'er317/target-func))
#+end_src

#+header: :noweb-ref el-example
#+begin_src emacs-lisp  
(setq debug-on-error t)
(er317/target-func :x 100)
#+end_src

#+RESULTS:
| :x | 100 | :y | 101 |

**** filesys
***** preamble

#+header: :noweb-ref el-filesys-beta
#+begin_src emacs-lisp
  (load-file "../el/list.el")
#+end_src

***** module
****** unique-file
******* directory
:PROPERTIES:
:customize: true
:END:

#+header: :noweb-ref el-filesys-beta
#+begin_src emacs-lisp
  (defconst er317/filesys-unique-directory (file-name-as-directory "~/unique") "Directory for storing unique files")
#+end_src

#+RESULTS:
: er317/filesys-unique-directory

******* make

#+header: :noweb-ref el-filesys-beta
#+begin_src emacs-lisp
  (cl-defun er317/filesys-unique-make
      (&key ((:ext ext-string))
            ((:directory directory-string) er317/filesys-unique-directory)
            ((:only-name only-name-bool)))
    "Create a uniquely named file in the given directory"
    (let* ((prefix (file-name-as-directory directory-string))
           (suffix (when ext-string (concat "." ext-string)))
           (dir-flag nil))
      (make-temp-file prefix dir-flag suffix)))
#+end_src

#+RESULTS:
: er317/filesys-unique-make

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (let* ((directory-string nil)
    (args (append (list :ext "org" :only-name t)
                  (when directory-string (list :directory directory-string)))))
    (apply #'er317/filesys-unique-make args))
#+end_src

#+RESULTS:
: /home/erwann/unique/ZlyJWc.org

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (let* ((directory-string "~/unique")
    (args (append (list :ext "org" :only-name t)
                  (when directory-string (list :directory directory-string)))))
    (apply #'er317/filesys-unique-make args))
#+end_src

#+RESULTS:
: /home/erwann/unique/GPmUqe.org

******* clone

#+header: :noweb-ref el-filesys-beta
#+begin_src emacs-lisp
  (cl-defun er317/filesys-unique-clone
      (&key
       ((:source source-file))
       ((:directory directory-string))
       ((:do-trash trash-bool) t))
    "Clone SOURCE-FILE to a uniquely named file in DIRECTORY-STRING.
         If DO-TRASH is non-nil, move the source file to trash.
         Returns the target-file."
    (let ((target-file
  	 (let ((args (er317/plist-if :ext (file-name-extension source-file) :only-name nil :directory directory-string)))
    	   (apply #'er317/filesys-unique-make args))))
      (with-temp-buffer
        (insert-file-contents source-file)
        (write-region (point-min) (point-max) target-file))
      (kill-new target-file)
      (message "Cloned source file (%s) to unique file: %s" source-file target-file)
      (when trash-bool
        (move-file-to-trash source-file)
        (message "Moved source file to trash: %s" source-file))
      target-file))
#+end_src

#+RESULTS:
: er317/filesys-unique-clone

******* interactive
******** code

#+header: :noweb-ref el-filesys-beta
#+begin_src emacs-lisp
  (cl-defun er317/filesys-unique-clone-interactive
      (source-file &key
                   ((:directory directory-string))
                   ((:do-trash trash-bool)))
    "Interactively clone SOURCE-FILE to a uniquely named one."
    (interactive "fEnter source file")
    ;; Warn if the source file is open in any buffer
    (dolist (buf (buffer-list))
      (when (and (buffer-file-name buf)
                 (file-equal-p source-file (buffer-file-name buf)))
        (warn "About to clone the file opened in buffer: %s" (buffer-name buf))))
    ;; Prepare arguments and call the cloning function
    (let ((plist (er317/plist-if :source source-file :directory directory-string :do-trash trash-bool)))
      (let ((target-file (apply #'er317/filesys-unique-clone plist)))
      (kill-new target-file)
      (message "Cloned %s to: %s (path copied to clipboard)" source-file target-file))))
#+end_src

#+RESULTS:
: er317/filesys-unique-clone-interactive

**** babel
***** load

#+header: :noweb-ref el-babel
#+begin_src emacs-lisp
  (load-file "./except.el")
#+end_src

#+header: :noweb-ref el-babel
#+begin_src emacs-lisp
  (load-file "./func.el")
#+end_src

***** info
****** refactor

#+header: :noweb-ref el-babel-info
#+begin_src emacs-lisp
  (er317/refactor
   :source-func 'org-babel-get-src-block-info
   :target-func 'er317/org-babel-info-as-plist
   :target-key-list (:no-eval :datum)
   :result-key-list (:lang :body :header-args :switches :name :start :coderef))
#+end_src

#+RESULTS:
: er317/org-babel-info-as-plist

#+header: :noweb-ref el-example
#+header: :var name="json-foo"
#+header: :results raw
#+begin_src emacs-lisp :wrap src json
    (let* ((location (org-babel-find-named-block name))
           (option-list '(:no-eval t)))
      (save-excursion
        (goto-char location)
        (plist-get (apply #'er317/org-babel-info-as-plist option-list) :body)))
#+end_src

#+RESULTS:
#+begin_src json
"{
    \"key\" : \"X\"
}"
#+end_src

