org/extension.org
****** group

#+header: :noweb-ref el-babel-info
#+begin_src emacs-lisp
  (er317/group-keyval-define :group 'babel-info)
#+end_src

#+RESULTS:
: er317/noweb-ref-babel-info-get

#+header: :noweb-ref el-babel-info
#+begin_src emacs-lisp
  (er317/group-info-put
   :method 'body
   :func '(lambda (refactored-info key-list) (plist-get refactored-info body))
   :doc "Maps an org babel info to itself")
#+end_src

***** comment

#+header: :noweb-ref el-babel-comment
#+begin_src emacs-lisp
  (cl-defun er317/org-babel-comment (&key lang)
    "Return a format control string for commenting in a given mode.
  LANG is a string like \"python\", \"sh\", or \"latex\"."
    (interactive)
    (let* ((mode-fn (intern (concat lang "-mode"))))
      (if (not (fboundp mode-fn))
          (error "Unrecognized mode function: %s" mode-fn)
        (with-temp-buffer
          (funcall mode-fn)
          (let ((start (or comment-start ""))
                (end (or comment-end "")))
            (if (string-empty-p end)
                ;; Single-line comment format
                (format "%s %%s" (string-trim start))
              ;; Block-style comment format
              (format "%s %%s %s" (string-trim start) (string-trim end))))))))
#+end_src

**** noweb-ref
:PROPERTIES:
:CUSTOM_ID: source-el-noweb-ref
:END:

***** module
****** filter

#+header: :noweb-ref el-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-filter
      (&key
       ref-list
       (head-re "^")
       (middle-re (format "\\(%s\\)" (string-join ref-list "\\|")))
       (tail-re "$")
       (regex (concat head-re middle-re tail-re))
       (func (lambda (refactored-info) (plist-get refactored-info :body)))
       arg-list
       (babel-info-option-list '(t))
       element-parse-option-list)
    "Filters source block info by matching noweb-ref on REGEX, transforming each as FUNC (AS-PLIST-INFO ARG-LIST)."
    (let ((results '()))
      (org-element-map (apply #'org-element-parse-buffer element-parse-option-list) 'src-block
        (lambda (src)
          (let* ((begin (org-element-property :begin src))
                 (info (save-excursion
                         (goto-char begin)
                         (apply #'er317/org-babel-info-as-plist babel-info-option-list)))
                 (params (plist-get info :header-args))
                 (ref (plist-get params :noweb-ref)))
            (when (and ref (string-match-p regex ref))
              (push (apply func info arg-list) results)))))
      (nreverse results)))
#+end_src

#+RESULTS:
: er317/noweb-ref-filter

#+header: :noweb yes
#+header: :results verbatim
#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/noweb-ref-filter
   :regex "sh-\\(hello\\|ahoy\\)"
   ;; :func #'identity
   )
#+end_src

#+RESULTS:
: (("sh" "'Ahoy, planet!'" ((:results . "replace") (:exports . "code") (:noweb-ref . "sh-ahoy") (:tangle . "no") (:hlines . "no") (:noweb . "no") (:cache . "no") (:session . "none")) "" nil 26969 "(ref:%s)") ("sh" "'Hello, world!'" ((:results . "replace") (:exports . "code") (:noweb-ref . "sh-hello") (:tangle . "no") (:hlines . "no") (:noweb . "no") (:cache . "no") (:session . "none")) "" nil 27043 "(ref:%s)") ("sh" "'Hello, debugger!'" ((:results . "replace") (:exports . "code") (:noweb-ref . "sh-hello") (:tangle . "no") (:hlines . "no") (:noweb . "no") (:cache . "no") (:session . "none")) "" nil 27117 "(ref:%s)"))

****** fold

#+header: :noweb-ref el-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-fold
      (&key
       filter-arg-list
       (func (lambda (body-list) (string-join body-list "\n")))
       arg-list)
    "Workflow:
     - VALUE <- `er317/noweb-ref-filter` FILTER-ARG-LIST
     - VALUE <- RESULT ARG-LIST
     - VALUE"
    (let* ((info-list
            (apply #'er317/noweb-ref-filter
                   ,@(filter-arg-list))
            (each-list (mapcar (lambda (info) (funcall each-func info ,@each-arg-list)) info-list)))
           (funcall fold-func map-list ,@fold-arg-list))))
#+end_src

#+RESULTS:
: er317/noweb-ref-assemble

****** fifo

#+header: :noweb-ref el-noweb
#+begin_src emacs-lisp
  (er317/noweb-ref-define
   :suffix-name "fifo"
   :doc-string "Sequentially expands noweb-refences.

              Applied         Optional
              to              arg-list
    EACH-FUNC each info       EACH-ARG-LIST
    FOLD-FUNC resulting list. FOLD-ARG-LIST"
   :key-other-list '(each-func each-arg-list fold-func fold-arg-list)
   :body  (let* ((info-list
  		(apply #'er317/noweb-ref-info-list
  		       ,@(key-main-list))
  	       (each-list (mapcar (lambda (info) (funcall each-func info ,@each-arg-list)) info-list)))
  	  (funcall fold-func map-list ,@fold-arg-list)))
#+end_src

****** org

#+header: :noweb-ref el-noweb-org
#+begin_src emacs-lisp
  (defconst er317/noweb-ref-org-config
      '( :url-ext-org "https://github.com/rogard/persemacs/raw/ffed250e6c0549bd75b26b95b26ec8e5ebc70382/org/extension.org"
         :url-org-el "https://github.com/rogard/persemacs/raw/ffed250e6c0549bd75b26b95b26ec8e5ebc70382/el/org.el"
         :org-heading "^\\*\\{4\\} noweb-ref[ \t]*:.*\\<tangle\\>.*:$" ) )
#+end_src

#+header: :noweb-ref el-noweb-org
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-org ()
    "Inserts Org support for noweb-ref"
    (let (
  	  (url-ext-org (plist-get er317/noweb-ref-config :url-ext-org))
  	  (url-org-el (plist-get er317/noweb-ref-config :url-org-el))
  	  (org-heading (plist-get er317/noweb-ref-config :org-heading))
  	  )
      (let ((local-file (make-temp-file "noweb-" nil ".el")))
        (url-copy-file url-org-el local-file t)
        (load-file local-file)
        (progn
  	(with-current-buffer (url-retrieve-synchronously url-ext-org)
      	  (re-search-forward "\n\n")
      	  (let ((content (buffer-substring (point) (point-max))))
      	    (with-temp-buffer
      	      (insert content)
      	      (goto-char (point-min))
      	      (org-mode)
      	      (search-forward org-heading)
      	      (org-back-to-heading)
      	      ;;(buffer-substring (point) (point-max))
      	      (org-cut-subtree))))
  	(er317/org-subtree-paste))
        (delete-file local-file))))
#+end_src

****** func-doc
******* define
******** info
********* json

#+begin_src emacs-lisp
  (er317/nowef-ref-register
   :key ':json
   :func (lambda (info) (json-read-from-string (plist-get (er317/org-babel-info-as-plist info) :body)))
   :doc "`json-read-from-string`"
   :group :read-info)
#+end_src

******** encode
********* json

#+begin_src emacs-lisp
  (er317/func-doc
   :key ':json-encode
   :fn (lambda (string-list) (string-join string-list "\n"))
   :doc "`json-encode`"
   :group :encode)
#+end_src

********* join

#+begin_src emacs-lisp
  (er317/func-doc
   :key ':join
   :fn (lambda (string-list) (string-join string-list "\n"))
   :doc "Joins strings"
   :group :encode)
#+end_src

********* tag

#+begin_src emacs-lisp
  (er317/func-doc
   :key ':
   :fn (lambda (info)
         (let* ((body (plist-get (er317/org-babel-info-as-plist info) :body))
  	      (header-args (plist-get (er317/org-babel-info-as-plist info) :header-args))
  	      (noweb-ref (plist-get header-args :noweb-ref)))
  	 (funcall (er317-func-doc))
  	 :doc "Fetches info's body"
  	 :read t)
#+end_src

******** other

#+begin_src emacs-lisp
    (er317/func-doc
     :key ':plain
     :fn (lambda (body)
           (let* ((lang (plist-get (er317/org-babel-info-as-plist info) :lang)
    	      (header-args (er317/org-babel-info-as-plist :info info :header-args))
    	      (noweb-ref (plist-get header-args :noweb-ref)))
           
           )
     :doc "Fetches info's body"
     :read t)
#+end_src

***** example

#+name: json-object
#+call: el-assemble[:results raw](ref-list='("foo" "bar" "qux"), key-list='("foo" "bar" "qux"))

#+RESULTS: json-object
{"foo":{"key":"X"},"bar":{"key":"Y"},"qux":[{"key":"W"},{"key":"Z"}]}

#+name: json-pp
#+call: el-json-pp[:results raw](json=json-object)

#+RESULTS: json-pp
{
  "foo": {
    "key": "X"
  },
  "bar": {
    "key": "Y"
  },
  "qux": [
    {
      "key": "W"
    },
    {
      "key": "Z"
    }
  ]
}

#+call: el-assemble[:post el-wrap(body=*this*,lang="json",ref="json-merge") :results raw](ref-list='("foo" "bar" "qux"), key-list='("foo" "bar" "qux"))

#+RESULTS:
#+header: :noweb-ref json-merge
#+begin_src json
{"foo":{"key":"X"},"bar":{"key":"Y"},"qux":[{"key":"W"},{"key":"Z"}]}
#+end_src

**** regex
***** module
****** union

#+header: :noweb-ref el-regex
#+begin_src emacs-lisp
  (cl-defun er317/union-re (&key string-list)
    "Return a regexp matching any string in STRING-LIST as a group."
    (format "\\(%s\\)" (string-join string-list "\\|")))
#+end_src

****** group

#+header: :noweb-ref el-regex
#+begin_src emacs-lisp
  (cl-defun er317/group-re (&key string)
    "Return a regexp as a group."
    (format "\\(%s\\)" string)
#+end_src

**** org
***** module
****** element

#+header: :noweb-ref el-org-beta
#+begin_src emacs-lisp
  (defun er317/filter-block-names (regex &optional file)
    "Filter the source block names using REGEX in FILE."
    (let ((block-names (reverse (org-babel-src-block-names file))))
      (cl-remove-if-not (lambda (block) (string-match-p regex block)) block-names)))
#+end_src

#+RESULTS:
: er317/filter-block-names

#+begin_src emacs-lisp
  (defun er317/element-headers-as-properties (element) "Element properties retrievable using plist-get"
         (flatten-list  (mapcar (lambda (string) (org-babel-parse-header-arguments string)) (org-element-property element))))
#+end_src

****** src-block

#+header: :noweb-ref el-src-block-beta
#+begin_src emacs-lisp
  (defun er317/src-block-properties (name &rest properties)
    "Return block properties from the named block element. Defaults to :value if no properties are given."
    (let* ((element (er317/src-block-element name))  ;; Use er317/src-block-element to get the block
           (props (if properties
                      properties
                    '(:value))))  ;; Default to :value if no properties are provided
      (mapcar (lambda (prop)
                (org-element-property prop element))  ;; Get each property using org-element-property
              props)))
#+end_src

****** subtree
******* TODO paste
:PROPERTIES:
:created_on: <2025-05-30 Fri 09:10>
:uname:    @elitebook
:END:
:LOGBOOK:
- Note taken on [2025-05-30 Fri 09:11] \\
  Though pastes in the right spot, indentation is messed up. Need to close/reopen file.
:END:

#+header: :noweb-ref el-org
#+begin_src emacs-lisp
    (cl-defun er317/org-subtree-paste
        (&key (target-file (buffer-file-name))
              (target-pos (point))
              (level-fn (lambda (level) (+ level 1))))
      "Paste into TARGET, the subtree in the clipboard.
    The level is set by LEVEL-FN; by default = point level +1.
  Tip: use `org-cut-subtree` prior to this one."
      (interactive)
      (unless (org-kill-is-subtree-p)
        (user-error "Clipboard does not contain a valid Org subtree"))
      (let (level)
        (with-current-buffer (find-file-noselect target-file)
          (goto-char target-pos)
          (setq level (funcall level-fn (org-current-level)))
  	(message "DEBUG: %s" level)
          (org-end-of-subtree)
          (org-paste-subtree level nil nil t)
          (save-buffer)
  	(format "Pasted subtree at level %d in %s" level target-file))))
#+end_src

#+RESULTS:
: er317/org-subtree--paste

******* promote

#+header: :noweb-ref org-subtree-beta
#+begin_src emacs-lisp
(defun er317/org-subtree-promote ()
  "Promote the current Org subtree.
If the top heading is level 1, replace it with a `#+TITLE:` line,
then promote the rest of the subtree."
  (interactive)
  (save-excursion
    (org-back-to-heading t)
    (let ((level (org-current-level))
          (title (org-get-heading t t t t))
          (heading-start (point))
          region-start region-end)
      (if (= level 1)
          (progn
            ;; Save where heading starts
            (setq region-start (progn
                                 (forward-line 1)
                                 (point)))
            (org-end-of-subtree t t)
            (setq region-end (point))

            ;; Replace heading line with #+TITLE:
            (goto-char heading-start)
            (delete-region (line-beginning-position) (1+ (line-end-position)))
            (insert (format "#+TITLE: %s\n" title))

            ;; Promote nested subtree (if any)
            (when (< region-start region-end)
              (org-map-region
               (lambda () (org-promote-subtree))
               region-start region-end)))
        ;; Otherwise just promote normally
        (org-promote-subtree)))))
#+end_src

#+RESULTS:
: er317/org-subtree-promote

**** shell
***** module
****** jq

#+header: :noweb-ref el-shell
#+begin_src emacs-lisp
  (cl-defun er317/jq-file (&key filter file options)
    "Apply a jq FILTER to a JSON FILE and return the result."
    (let* ((parts (delq nil (append (list "jq") options (list (format "'%s'" filter) file)))) (command (string-join parts " ")))
;;    (message "DEBUG: parts: %s" parts)
;;    (message "DEBUG: command: %s" command)
    (shell-command-to-string command)))
#+end_src

#+RESULTS:
: er317/jq-file

****** string

#+header: :noweb-ref el-shell
#+begin_src emacs-lisp
  (cl-defun er317/jq-string (&key filter string options)
    "Apply a jq filter to a JSON string and return the result."
    (let* ((temp-file (make-temp-file nil nil ".json"))
           (result (progn
                     (with-temp-file temp-file
                       (insert string))
                     (er317/jq-file :filter filter :file temp-file :options options))))
      (delete-file temp-file)
      (format "%s" result)))
#+end_src

#+RESULTS:
: er317/jq-string

#+header: :noweb-ref el-example
#+header: :results raw
#+header: :var json-object=(org-babel-ref-resolve "json-foo")
#+header: :wrap src json
#+begin_src emacs-lisp  
  (er317/jq-string :filter "." :string json-object :options '("-c"))
#+end_src

#+RESULTS:
#+begin_src json
{"key":"X"}
#+end_src

**** symb
