org/extension.org
***** combo

#+header: :noweb-ref el-symb-beta
#+begin_src emacs-lisp
  (cl-defun er317/symb-combo-next (&key (start-symb nil) (next-symb nil) (msg-type 'error) (key-p t))
    "Return a new interned symbol by appending NEXT-SYMB to START-SYMB using a separator."
    (condition-case err
        (cond
         ((null start-symb) start-symb)
         ((null next-symb) start-symb)
         ((not (symbolp next-symb))
          (error "NEXT-SYMB is not a symbol: %S" next-symb))
         ((and key-p (not (keywordp start-symb)))
          (error "START-SYMB is not a keyword: %S" start-symb))
         (t
          (let* ((sep "-")
                 (string-list (mapcar #'symbol-name (list start-symb next-symb)))
                 (symb-string (string-join string-list sep)))
            (intern (format "%s" symb-string)))))
      (error
       (er317/raise
        :type msg-type
        :message (error-message-string err)
        :arg-list (list :start-symb ,start-symb :next-symb ,next-symb))
       )))
#+end_src

#+RESULTS:
: er317/symb-combo-next


#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/symb-combo-next :start-symb ':foo :next-symb 'bar)
#+end_src

#+RESULTS:
: :foo-bar

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
(mapcar (lambda (args)
          (apply #'er317/symb-combo-next args))
        (list nil
          (list :start-symb :foo)
          (list :start-symb :foo :next-symb 'bar)))
#+end_src

#+RESULTS:
| nil | :foo | :foo-bar |

#+header: :noweb-ref el-symb
#+begin_src emacs-lisp
  (cl-defun er317/symb-combo-list (&key (start-symb nil) (symb-list '()) (msg-type 'error) (key-p t))
    "Recursively builds a keyword by combining START-SYMB with each symbol in SYMB-LIST."
    (condition-case err
        (cond
         ((not (listp symb-list))
  	(error "SYMB-LIST is not a list: %S" symb-list))

         ((null symb-list)
  	(er317/symb-combo-next :start-symb start-symb :key-p key-p))
         (t
  	(let* ((next-symb (car symb-list))
                 (rest-symbs (cdr symb-list))
  	       ;; BUG:
                 (next-key (er317/symb-combo-next
  			  :start-symb start-symb
  			  :next-symb next-symb
  			  :msg-type msg-type))
  	       )
  	  (er317/symb-combo-list
  	   :start-symb next-key
  	   :symb-list rest-symbs
  	   :msg-type msg-type
  	   :key-p key-p))))
      (error
       (er317/raise
        :type msg-type
        :message (error-message-string err)))))
#+end_src

#+RESULTS:
: er317/symb-combo-list


#+begin_src emacs-lisp
  (er317/symb-combo-list :start-symb :foo :symb-list '(bar))
#+end_src

#+RESULTS:
: :foo-bar

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (mapcar
   (lambda (args)
     (apply #'er317/symb-combo-list args))
   (list
    nil
    (list :start-symb :foo)
    (list :start-symb :foo :symb-list '(bar))
    (list :start-symb :foo :symb-list '(bar baz))))
#+end_src

#+RESULTS:
| nil | :foo | :foo-bar | :foo-bar-baz |

**** read

#+header: :noweb-ref el-read
#+begin_src emacs-lisp
  (defconst er317/read-config-plist "Configuration plist for `silo`"
    '(:define-name-list
      '("defun"
        "defmacro"
        "cl-defun"
        "cl-defmacro"
        "defsubst"
        "defalias"
        "defvar"
        "defconst"
        "defcustom"
        "defparameter"
        "defstruct"
        "cl-defstruct"
        "deftype"
        "defclass"
        "defmethod"
        "defgeneric"
        "define-derived-mode"
        "define-minor-mode"
        "define-skeleton"
        "define-widget"
        "define-compilation-mode"
        "define-error"
        "define-obsolete-function-alias"
        "define-obsolete-variable-alias"))
#+end_src

#+header: :noweb-ref el-read
#+begin_src emacs-lisp
  (defun er317/read-defined-symbols
      (&key
       ;; url TODO
       ;; noweb-ref TODO
       noweb-ref-fold-plist
       (string (when noweb-ref-plist
                 (apply #'er317/noweb-ref-fold noweb-ref-fold-plist)))
       file
       (buffer (cond
                (file (find-file-noselect file))
                (string
                 (let ((name (generate-new-buffer "*er317/read-symbols*")))
  		 (with-current-buffer name
  		   (goto-char (point-min))
  		   (insert expand))
  		 buffer-name))
                (t nil)))
       (define-name-list (plist-get er317/read-config-plist :define-name-list)))
    "Return a list of symbols defined in BUFFER matching DEFINE-NAME-LIST."
    (interactive)
    (let* ((result '())
           (regexp (format "^(\\(%s\\)\\_>" (string-join define-name-list "\\|"))))
      (with-current-buffer buffer
        (save-excursion
          (goto-char (point-min))
          (while (re-search-forward regexp nil t)
            (goto-char (match-beginning 0))
            (condition-case nil
                (let ((form (read (current-buffer))))
                  (when (and (consp form)
                             (member (symbol-name (car form)) define-name-list)
                             (symbolp (cadr form)))
                    (push (cadr form) result)))
              (error nil)))))
      (nreverse result)))
#+end_src

** json
*** test-cases

Keep both the name and noweb-ref.

#+name: json-foo
#+header: :noweb-ref json-foo
#+begin_src json
  {
      "key" : "X"
  }
#+end_src

#+header: :noweb-ref json-bar
#+begin_src json
  {
      "key" : "Y"
  }
#+end_src

#+header: :noweb-ref json-qux
#+begin_src json
  [
      {
  	"key":"W"
      },
      {
  	"key":"Z"
      }
  ]
#+end_src

#+header: :noweb-ref json-baz
#+begin_src sh
  {
      "file":
      ["John	Doe",
       "Jane Smith"]
  }
#+end_src

** org
*** support

#+header: :noweb-ref org-support
#+begin_src org
  ,#+name: el-collect
  ,#+header: :results raw
  ,#+header: :var head="^sh-"
  ,#+header: :var tail="$"
  ,#+header: :var ref-list='("foo" "bar" "foo")
  ,#+begin_src emacs-lisp
    (string-join
     (er317/noweb-ref-collect :head head :ref-list ref-list :tail tail) "\n")
  ,#+end_src
#+end_src

*** test-cases
**** tbl

#+name: tbl-foo-bar-string
| "foo" | "x" |
| "bar" | "y" |

#+name: tbl-foo-bar-dir
| "foo" | "./foo" |
| "bar" | "./bar" |
*** notes
**** TODO tangle
:PROPERTIES:
:created_on: <2025-05-22 Thu 20:10>
:uname:    @elitebook
:END:
:LOGBOOK:
- Note taken on [2025-05-22 Thu 20:11] \\
  TARGET-FILE not seem reliable
:END:

#+begin_src emacs-lisp
  (org-babel-tangle &optional ARG TARGET-FILE LANG-RE)
#+end_src

** sh
*** test-cases

#+header: :noweb-ref sh-shebang
#+begin_src sh
  #!/usr/bin/env bash
#+end_src

#+header: :noweb-ref sh-cat-eof
#+begin_src sh
  cat << EOF 
#+end_src

#+header: :noweb-ref sh-ahoy
#+begin_src sh
  'Ahoy, planet!'
#+end_src

#+header: :noweb-ref sh-hello
#+begin_src sh
  'Hello, world!'
#+end_src

#+header: :noweb-ref sh-hello
#+begin_src sh
  'Hello, debugger!'
#+end_src

#+header: :noweb-ref sh-eof
#+begin_src sh
  EOF
#+end_src

#+name: bar-qux
#+header: :var value="qux"
#+begin_src sh
  echo "${value}"
#+end_src

* tangle
** el
*** noweb
:PROPERTIES:
:header-args: :tangle "../el/noweb.el"
:END:

#+header: :noweb yes
#+begin_src emacs-lisp
  <<el-license>>
#+end_src

#+header: :noweb yes
#+begin_src emacs-lisp
  <<el-noweb>>
#+end_src

#+header: :noweb yes
#+begin_src emacs-lisp
  <<el-noweb-org>>
#+end_src

*** json
:PROPERTIES:
:header-args: :tangle "../json/merge.json"
:END:

#+header: :noweb yes
#+begin_src json
  <<json-merge>>
#+end_src

*** org
:PROPERTIES:
:header-args: :tangle "../org/org.el"
:END:

#+header: :noweb yes
#+begin_src emacs-lisp
  <<el-license>>
  <<el-org>>
#+end_src

#+RESULTS:
: er317/noweb-concat

*** shell
:PROPERTIES:
:header-args: :tangle "../el/shell.el"
:END:

#+header: :noweb yes
#+begin_src emacs-lisp
  <<el-license>>
  <<el-shell>>
#+end_src
* trash
** global-alist
*** backend

#+header: :noweb-ref el-keyval
#+begin_src emacs-lisp
  (defvar er317/global-alist nil "A global alist.")
#+end_src

#+header: :noweb-ref el-noweb-ref
#+begin_src emacs-lisp
  (cl-defun er317/global-alist-put-backend (&key group method ((:value plist)))
    "Store PLIST under (GROUP . METHOD)."
    (let ((key (cons group method))
  	(existing (assoc (cons group method) er317/global-alist)))
      (if existing
  	(setcdr existing plist)
        (push (cons key plist) er317/global-alist))))
#+end_src

#+RESULTS:
: er317/global-alist-put-backend

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/global-alist-put-backend :group "test"  :method "foo" :value '(:func (lambda () (message "hello"))))
#+end_src

#+RESULTS:
| (test . foo) | :func | (lambda nil (message hello)) |

#+header: :noweb-ref el-noweb-ref
#+begin_src emacs-lisp
(cl-defun er317/global-alist-get-backend (&key group method key)
  "Retrieve a plist value for (GROUP . METHOD) using keys in ARGS.
ARGS must contain exactly one key from the known keys."
  (let* ((lookup-key (cons group method))
         (prop-list (cdr (assoc lookup-key er317/global-alist))))
    (plist-get prop-list key)))
#+end_src

#+RESULTS:
: er317/global-alist-get-backend

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/global-alist-get-backend :group "test" :method "foo" :key :func)
#+end_src

#+RESULTS:
| lambda | nil | (message hello) |

*** define

#+RESULTS:
: er317/global-alist

#+header: :noweb-ref el-noweb-ref
#+begin_src emacs-lisp
  (cl-defmacro er317/global-alist-define (&key group msg-type (symb-list '(func doc)))
    "Define put/get frontend functions for GROUP, delegating to shared backends."
    (condition-case err
        (let* ((group-symb (if (and (consp group) (eq (car group) 'quote))
                               (cadr group)
                             group))
               (group-name (symbol-name group-symb))
               (keyval-and-keys
                (cl-loop for symb in symb-list
                         for key = (intern (format ":%s" (symbol-name symb)))
                         append (list key symb) into keyval-list
                         collect key into key-list
                         finally return (list keyval-list key-list)))
               (keyval-list (car keyval-and-keys))
               (key-list (cadr keyval-and-keys))
               (put-name (intern (format "er317/noweb-ref-%s-put" group-name)))
               (get-name (intern (format "er317/noweb-ref-%s-get" group-name))))
          `(progn
             (cl-defun ,put-name (&key method ,@symb-list)
               ,(format "Frontend put for group `%s` storing keys: %s"
                        group-name (mapconcat #'symbol-name key-list ", "))
               (er317/global-alist-put-backend
                :group ',group-symb
                :method method
                :value (list ,@(cl-loop for symb in symb-list
                        for key = (intern (format ":%s" (symbol-name symb)))
                        collect key
                        collect symb))))

             (cl-defun ,get-name (&rest rest)
               ,(format "Frontend get for group `%s`, forwarding keys %s to backend"
                        group-name (mapconcat #'symbol-name key-list ", "))
               (apply #'er317/global-alist-get-backend
                      :group ',group-symb rest))))
      (er317/raise
       :type msg-type
       :message (error-message-string err))))
#+end_src

#+RESULTS:
: er317/global-alist-define

** compose

#+header: :noweb-ref el-trash
#+begin_src emacs-lisp
  (defun er317/compose (arg &rest functions)
    "Apply a sequence of FUNCTIONS to ARG in composition order."
    (cl-reduce (lambda (acc fn) (funcall fn acc))
               (reverse functions)
               :initial-value arg))
#+end_src

#+RESULTS:
: er317/compose

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/compose 4 #'sqrt (lambda (x) (+ 1 x)))
#+end_src

#+RESULTS:
: 3.0

** noweb-ref
*** expand

#+header: :noweb-ref el-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-expand (&key regex)
    "Expands all source blocks whose :noweb-ref matches REGEX and returns their expanded contents in a list."
    (let ((results '()))
      (org-element-map (org-element-parse-buffer) 'src-block
        (lambda (src)
          (let* ((begin (org-element-property :begin src))
                 (info (save-excursion
                         (goto-char begin)
                         (org-babel-get-src-block-info t)))
                 (params (nth 2 info))  ; header arguments parsed by org-babel
                 (ref (cdr (assoc :noweb-ref params))))
            ;; (message "DEBUG parsed params: %S" params)
            (when (and ref (string-match-p regex ref))
              (let ((expanded (org-babel-expand-noweb-references info)))
                (push expanded results))))))
      (nreverse results)))
#+end_src

#+RESULTS:
: er317/noweb-ref-expand

#+header: :noweb yes
#+header: :results verbatim
#+header: :noweb-ref el-example
#+begin_src emacs-lisp
   (er317/noweb-ref-expand :regex "sh-\\(hello\\|ahoy\\)")
#+end_src

#+RESULTS:
: ("'Hello, world!'" "'Hello, debugger!'" "'Ahoy, planet!'")

*** collect

#+header: :noweb-ref el-noweb
#+begin_src emacs-lisp
  (cl-defun er317/noweb-ref-collect
      (&key head ref-list tail (results '()) (order :buffer))
    "Collect source blocks' info matching REF-LIST in ORDER (:buffer or :ref-list)."
    (pcase order
      (:ref-list
       ;; One-by-one regex match per ref
       (if (null ref-list)
           results
         (let* ((ref (car ref-list))
                (regex (concat (or head "") ref (or tail "")))
                (segment-results (apply #'er317/noweb-ref-info `(:regex ,regex))))
           (er317/noweb-ref-collect
            :head head
            :ref-list (cdr ref-list)
            :tail tail
            :results (append results segment-results)
            :order order))))
      (:buffer
       ;; Collapse ref-list into a single regex, match in buffer order
       (let* ((regex-body (mapconcat #'identity ref-list "\\|"))
              (regex (concat (or head "") "\\(" regex-body "\\)" (or tail "")))
              (segment-results (apply #'er317/noweb-ref-info `(:regex ,regex))))
         (append results segment-results)))
      (_ (error "Unknown :order %s" order))))
#+end_src

#+RESULTS:
: er317/noweb-ref-collect

#+header: :results raw code
#+begin_src emacs-lisp
  (er317/noweb-ref-collect
   :head "^sh-" :ref-list '("shebang" "hello") :tail "$")
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
(("sh" "#!/usr/bin/env bash"
  ((:results . "replace") (:exports . "code")
   (:noweb-ref . "sh-shebang") (:tangle . "no") (:hlines . "no")
   (:noweb . "no") (:cache . "no") (:session . "none"))
  "" nil 27871 "(ref:%s)")
 ("sh" "'Hello, world!'"
  ((:results . "replace") (:exports . "code")
   (:noweb-ref . "sh-hello") (:tangle . "no") (:hlines . "no")
   (:noweb . "no") (:cache . "no") (:session . "none"))
  "" nil 28094 "(ref:%s)")
 ("sh" "'Hello, debugger!'"
  ((:results . "replace") (:exports . "code")
   (:noweb-ref . "sh-hello") (:tangle . "no") (:hlines . "no")
   (:noweb . "no") (:cache . "no") (:session . "none"))
  "" nil 28168 "(ref:%s)"))
#+end_src

Evaluate (~C-c C-c~)
#+call: el-collect[:post el-wrap(body=*this*,lang="sh",ref="sh-coll")](ref-list='("shebang" "cat-eof" "hello" "ahoy" "eof"), order=':buffer)

#+call: el-collect(ref-list='("shebang" "cat-eof" "hello" "ahoy" "eof"), order=':buffer)

#+RESULTS:
#+header: :noweb-ref sh-coll
#+begin_src sh
#!/usr/bin/env bash
cat << EOF 
'Ahoy, planet!'
'Hello, world!'
'Hello, debugger!'
EOF
#+end_src

Evaluate (~C-c C-c~)
#+call: el-collect[:post el-wrap(body=*this*,lang="sh",ref="sh-coll")](ref-list='("shebang" "cat-eof" "hello" "ahoy" "eof"), order=':ref-list)

#+RESULTS:
#+header: :noweb-ref sh-coll
#+begin_src sh
#!/usr/bin/env bash
cat << EOF 
'Hello, world!'
'Hello, debugger!'
'Ahoy, planet!'
EOF
#+end_src

** org
