org/extension.org
*** src-block

#+header: :noweb-ref el-src-block-beta
#+begin_src emacs-lisp
  (defun er317/src-block-element (name) "Return the whole block element"
         (save-excursion
  	 (goto-char (org-babel-find-named-block name))
  	 (org-element-at-point)))
#+end_src

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/src-block-element "bar-qux")
#+end_src

*** property
**** define

#+header: :noweb-ref el-org-beta
#+begin_src emacs-lisp
  (cl-defmacro er317/org-property-define (&key
                                        ((:name name-symb))
                                        ((:key key-string))
                                        ((:value value-lambda)))
    "Create a function NAME-SYMB to set Org property KEY-STRING using VALUE-LAMBDA."
    (let ((name-symb (or name-symb
                         (intern (concat "er317/org-property-" key-string)))))
      `(cl-defun ,name-symb (&rest keyval)
         ,(format "Set the Org property %s using a computed value." key-string)
         (let ((value (save-excursion (apply ,value-lambda keyval))))
           (org-set-property ,key-string value)))))
#+end_src

#+RESULTS:
: er317/org-property-define

**** apply

#+header: :noweb-ref el-org-beta
#+begin_src emacs-lisp
  (er317/org-property-define
   :key "parent-id"
   :value (lambda ()
            (when (org-up-heading-safe)
              (org-id-get-create))))
#+end_src

#+RESULTS:
: er317/org-property-parent-id

*** src-block
**** module
***** info

#+header: :noweb-ref el-src-block-beta
#+begin_src emacs-lisp
  (defun er317/src-block-info (name &optional no-eval)
    "Gets info of block NAME"
    (let ((block (org-babel-find-named-block name)))
  	 (when block
  		 (save-excursion
                     (goto-char block)
                     (org-babel-get-src-block-info no-eval)))))
#+end_src

#+RESULTS:
: er317/src-block-info

#+header:  :noweb-ref el-example
#+begin_src emacs-lisp
(er317/src-block-info "json-foo")
#+end_src

#+RESULTS:
| json | { "key" : "X" } | ((:colname-names) (:rowname-names) (:result-params replace) (:result-type . value) (:results . replace) (:exports . code) (:tangle . no) (:hlines . no) (:noweb . no) (:cache . no) (:session . none)) |   | json-foo-bar | 1239 | (ref:%s) |

#+header: :noweb-ref el-example
#+header: :results verbatim raw
#+begin_src emacs-lisp
  (er317/src-block-properties "bar-qux" :header)
#+end_src

#+RESULTS:
((":var value=\"qux\""))

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (org-babel-parse-header-arguments
   (mapconcat (lambda (pair) (concat (car pair) " " (cadr pair)))
              (er317/src-block-properties "bar-qux" :header)
              " "))
#+end_src

#+RESULTS:
: ((:var . value="qux"))

** global

#+header: :noweb-ref el-org-beta
#+begin_src emacs-lisp
  (cl-defun er317/org-global-header-position-next (&optional buffer)
    "Return the BUFFER position where the next global header line (e.g. `#+property:`) should be inserted."
    (with-current-buffer (or buffer (current-buffer))
      (save-excursion
        (goto-char (point-min))
        (while (looking-at "^#\\+\\w+:")
          (forward-line 1))
        (point))))
#+end_src

** table
:LOGBOOK:
- Note taken on [2025-05-25 Sun 21:55] \\
  Works, but just not needed anymore.
:END:

*** module
**** field-address
***** code
#+header: :noweb-ref el-table
#+begin_src emacs-lisp
  (defun er317/function-table-field-address (index)
    "Table address for field INDEX"
    (format "@1$%d..@>$%d" index index))
  (defalias 'er317/field-address 'er317/function-table-field-address)
#+end_src

#+RESULTS:
: er317/field-address

***** example
#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/field-address 2)
#+end_src

#+RESULTS:
: @1$2..@>$2

**** get-range
***** code
#+header: :noweb-ref el-table
#+begin_src emacs-lisp
  (defun er317/function-table-get-range-at-file (tbl-id range-address &optional file-name)
    "Get list of values in RANGE-ADDRESS from TBL-ID at FILE-NAME.
       Credits: https://redd.it/r2nig7"
    (let ((file-name (or file-name (buffer-file-name (current-buffer)))))
      (with-current-buffer (find-file-noselect file-name)
        (let ((result-with-properties
               (org-table-get-remote-range tbl-id range-address)))
          (mapcar (lambda (s)
                    (substring-no-properties (substring s 1 -1)))
                  result-with-properties)))))
  (defalias 'er317/table-range 'er317/function-table-get-range-at-file)
#+end_src

#+RESULTS:
: er317/table-range

***** example

#+header: :noweb-ref el-example
#+header: :results value verbatim
#+begin_src emacs-lisp
(er317/table-range "tbl-foo-bar-string" (format "@1$%d..@>$%d" 2 2))
#+end_src

#+RESULTS:
: ("x" "y")

**** lookup
***** code
#+header: :noweb-ref el-table
#+begin_src emacs-lisp
    (defun er317/function-table-lookup (tbl-id key &optional file-name key-index value-index match-predicate)
      "Lookup field KEY-INDEX and return corresponding entry in field VALUE-INDEX from table TBL-ID."
      (interactive)
      (let ((key-address (er317/field-address (or key-index 1)))
            (value-address (er317/field-address (or value-index 2)))
            (file-name (or file-name (buffer-file-name (current-buffer))))
            (match-predicate (or match-predicate 'string-match-p)))
        (let ((key-range (er317/table-range tbl-id key-address file-name))
              (value-range (er317/table-range tbl-id value-address file-name)))
          (org-lookup-first key key-range value-range 'string-match-p))))
  (defalias 'er317/table-lookup 'er317/function-table-lookup)
#+end_src

#+RESULTS:
: er317/table-lookup

***** example

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
(er317/table-lookup "tbl-foo-bar-string" "foo")
#+end_src

#+RESULTS:
: x

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
(er317/table-lookup "tbl-foo-bar-string" "bar")
#+end_src

#+RESULTS:
: y

* scratch
** el
*** func
**** default


#+header: :noweb-ref el-func-beta
#+begin_src emacs-lisp
  (cl-defun er317/debug-func (&rest rest &allow-other-keys &key key) (message "DEBUG %S" key))
#+end_src

#+RESULTS:
: er317/debug-func

#+header: :noweb-ref el-example
#+begin_src emacs-lisp
  (er317/debug-func :foo :key 'bar)
#+end_src

#+RESULTS:
: DEBUG nil

#+header: :results raw
#+header: :noweb-ref el-example
#+begin_src emacs-lisp
(er317/func-default :func 'er317/debug :key :foo)
#+end_src
*** generic
**** meta

#+begin_src emacs-lisp
    (cl-defmacro er317/generic-meta (&key symb-list rest-list)
      "Define a forwarding macro that wraps `er317/generic-keyval-put`.

        SYMB-LIST determines the prefix for the :key.
        REST-LIST is a list of expected keyword arguments to forward."
      (let* ((symb (er317/symb-combo-list
                    :start-symb 'er317/generic
                    :symb-list symb-list
                    :key-p nil))
    	 macroput macro
  	 -get))
      (dolist (suffix '(put get))
        (progn
          (setq (intern (string-join (symbol-name symb) suffix "-"))    	 
      	    (symb-put (er317/symb-combo-list
                           :start-symb symb
                           :symb-list (list ,(intern suffix))
                           :key-p nil)))))
      (arglist (append '(&key key) (mapcar (lambda (k) (intern (format "%s" k))) rest-list)))
      (body `(er317/generic-keyval-put
      	  :symb-list (append ',symb-list (list key))
      	  ,@(apply #'append
      		   (mapcar (lambda (k)
      			     (let ((sym (intern (format "%s" k))))
      			       (list (intern (format ":%s" k)) sym)))
      			   rest-list)))))
    `(cl-defmacro ,macro-put ,arglist
       ,(format "Auto-generated macro forwarding to `er317/generic-keyval-put` with prefix `%s`." symb-list)
       ,body)))
#+end_src

**** frontend

#+begin_src emacs-lisp
  (cl-defmacro er317/generic-info (&key key func doc) ""
  	     :group 'info
  	     :key key
  	     :func func
  	     :doc doc)
#+end_src

**** instance
***** requirement

#+begin_src emacs-lisp
  (er317/generic-put
   :group :group
   :key :arg-name
   :func nil
   :semantic
   :doc "Declaring :arg-name as a group")
#+end_src

#+begin_src emacs-lisp
  (er317/generic-put
   :group :arg-name
   :key :babel-info
   :func (lambda (func) (help-function-arglist func)
        	 (equal '(info) '(info)))
   :doc "Checks argument name")
#+end_src

** sh

#+begin_src sh
  json=$(
      cat <<'EOF'
  {
    "file":
    ["John\tDoe",
     "Jane\tSmith"]
  }
  EOF
      )

  # Iterate over each line in the array, splitting on tab
  echo "$json" | jq -r '.file[]' | while IFS=$'\t' read -r first last; do
      printf 'first=%s; last=%s\n' "$first" "$last"
  done

#+end_src

#+RESULTS:
| first=John; | last=Doe   |
| first=Jane; | last=Smith |

